<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"web2/production","backend":"82fe54fecaf1873e6a4b87ccc4f4541c526f1c2524ac5705247c588edb424f6c","plan_job_ref":"Job Generate OpenTofu Plan #111 at https://github.com/alexdragongc/test-vercel-backend-hello-world-iac/actions/runs/22149222574","plan_out_hash":"544dad668df418f3d8d8234f777b5d41ed2bd6f04342ba0bcd8ed456eaee3da9","plan_hash":"9c58ff9a39b374e6931bc36904dca430641812415c9a135256e73dc721a84419","plan_text_format":"diff","version":"2.2.3","closed":true} -->
OpenTofu plan for __web2/production__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place (current -> planned)

OpenTofu will perform the following actions:

  # vercel_project.my_project will be updated in-place
!~  resource "vercel_project" "my_project" {
+       build_machine_type                                = (known after apply)
+       enable_preview_feedback                           = (known after apply)
+       git_provider_options                              = (known after apply)
!~      git_repository                                    = {
!~          repo              = "alexangc/test-vercel-backend-hello-world-iac" -> "alexdragongc/test-vercel-backend-hello-world-iac"
#            (2 unchanged attributes hidden)
        }
        id                                                = "prj_4igk5rFnp5HoO3YeuZjbFLg4lDhQ"
        name                                              = "web2"
+       preview_comments                                  = (known after apply)
+       protection_bypass_for_automation_secret           = (sensitive value)
!~      resource_config                                   = {
+           function_default_cpu_type = (known after apply)
+           function_default_timeout  = (known after apply)
#            (2 unchanged attributes hidden)
        }
!~      serverless_function_region                        = "iad1" -> (known after apply)
+       team_id                                           = (known after apply)
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Apply OpenTofu Plan #64](https://github.com/alexdragongc/test-vercel-backend-hello-world-iac/actions/runs/22149254656)